<?php
declare(strict_types=1);

return [
	'คณะวิทยาศาสตร์และเทคโนโลยี' => [
		'สาขาวิชาวิทยาการคอมพิวเตอร์',
		'สาขาวิชาเทคโนโลยีสารสนเทศ',
		'สาขาวิชาเกษตรศาสตร์',
		'สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม',
		'สาขาวิชาคณิตศาสตร์และสถิติประยุกต์',
	],
	'คณะเทคโนโลยีสารสนเทศ' => [
		'สาขาวิชาเทคโนโลยีสารสนเทศและนวัตกรรมดิจิทัล',
		'สาขาวิชาคอมพิวเตอร์ธุรกิจ',
	],
	'คณะครุศาสตร์' => [
		'สาขาวิชาการศึกษาปฐมวัย',
		'สาขาวิชาภาษาไทย',
		'สาขาวิชาภาษาอังกฤษ',
		'สาขาวิชาคณิตศาสตร์',
		'สาขาวิชาวิทยาศาสตร์ทั่วไป',
		'สาขาวิชาพลศึกษา',
	],
	'คณะบริหารธุรกิจและการบัญชี' => [
		'สาขาวิชาการจัดการ',
		'สาขาวิชาการตลาดดิจิทัล',
		'สาขาวิชาการบัญชี',
	],
	'คณะมนุษยศาสตร์และสังคมศาสตร์' => [
		'สาขาวิชาภาษาไทยเพื่อการสื่อสาร',
		'สาขาวิชาภาษาอังกฤษเพื่อการสื่อสารสากล',
		'สาขาวิชาพัฒนาชุมชน',
	],
	'คณะนิติรัฐศาสตร์' => [
		'สาขาวิชานิติศาสตร์',
		'สาขาวิชารัฐประศาสนศาสตร์',
	],
	'คณะพยาบาลศาสตร์' => [
		'สาขาวิชาพยาบาลศาสตร์',
	],
];