<?php
declare(strict_types=1);

return [
	'ระดับปริญญาตรี (Undergraduate)' => [
		'วิทยาศาสตรบัณฑิต (วท.บ.)' => [
			'สาขาวิชาวิทยาการคอมพิวเตอร์',
			'สาขาวิชาเทคโนโลยีสารสนเทศ',
			'สาขาวิชาเกษตรศาสตร์',
			'สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม',
		],
		'ครุศาสตรบัณฑิต (ค.บ.)' => [
			'สาขาวิชาการศึกษาปฐมวัย',
			'สาขาวิชาภาษาไทย',
			'สาขาวิชาภาษาอังกฤษ',
			'สาขาวิชาคณิตศาสตร์',
			'สาขาวิชาวิทยาศาสตร์ทั่วไป',
			'สาขาวิชาพลศึกษา',
		],
		'บริหารธุรกิจบัณฑิต (บธ.บ.)' => [
			'สาขาวิชาการจัดการ',
			'สาขาวิชาการตลาดดิจิทัล',
			'สาขาวิชาคอมพิวเตอร์ธุรกิจ',
		],
		'บัญชีบัณฑิต (บช.บ.)' => [
			'สาขาวิชาการบัญชี',
		],
		'นิติศาสตรบัณฑิต (น.บ.)' => [
			'สาขาวิชานิติศาสตร์',
		],
		'รัฐประศาสนศาสตรบัณฑิต (รป.บ.)' => [
			'สาขาวิชารัฐประศาสนศาสตร์',
		],
		'พยาบาลศาสตรบัณฑิต (พย.บ.)' => [
			'สาขาวิชาพยาบาลศาสตร์',
		],
	],
	'ระดับบัณฑิตศึกษา (Graduate)' => [
		'ระดับปริญญาโท (ค.ม. / รป.ม. / บธ.ม.)' => [
			'สาขาวิชาการบริหารการศึกษา',
			'สาขาวิชาหลักสูตรและการสอน',
			'สาขาวิชารัฐประศาสนศาสตร์',
		],
		'ระดับปริญญาเอก (ปร.ด.)' => [
			'สาขาวิชาการบริหารการพัฒนาการศึกษา',
			'สาขาวิชายุทธศาสตร์การพัฒนาภูมิภาค',
		],
	],
];